mhmayyan/CUIR_Boards/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification
# Modified by Mohammad Mayyan
# March 8th, 2020

menu.pnum=Board part number

#menu.xserial=U(S)ART support
#menu.usb=USB support (if available)
#menu.xusb=USB speed (if available)

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

menu.sysclk=System clock

menu.show_serial_prints=Show Debugging Serial Prints
menu.smplIntrvl=Sampling Interval

################################################################################
# IRSB

IRSB.name=IRSB (The Sensor Board)

IRSB.build.vid=0x0483
IRSB.build.core=arduino
IRSB.build.board=IRSB
IRSB.build.extra_flags=-D{build.product_line} {build.xSerial} -DARDUINO_IRSB_V0 -DENABLE_HWSERIAL2 -DENABLE_HWSERIAL4 {build.show_serial_prints_flags} {build.sysclk_flags}

# IRSB board
IRSB.upload.maximum_size=196608
IRSB.upload.maximum_data_size=20480
IRSB.build.mcu=cortex-m0
IRSB.build.board=IRSB
IRSB.build.series=STM32L0xx
IRSB.build.product_line=STM32L082xx
IRSB.build.variant=IRSB
IRSB.build.cmsis_lib_gcc=arm_cortexM0l_math

############# Serialx activation
#IRSB.menu.xserial.generic=Enabled (generic 'Serial')
#IRSB.menu.xserial.none=Enabled (no generic 'Serial')
#IRSB.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
#IRSB.menu.xserial.disabled=Disabled (No Serial support)
#IRSB.menu.xserial.disabled.build.xSerial=


#################### USB connectivity
#IRSB.menu.usb.none=None
#IRSB.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
#IRSB.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
#IRSB.menu.usb.CDC=CDC (no generic 'Serial')
#IRSB.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
#IRSB.menu.usb.HID=HID (keyboard and mouse)
#IRSB.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#IRSB.menu.xusb.FS=Low/Full Speed
#IRSB.menu.xusb.HS=High Speed
#IRSB.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
#IRSB.menu.xusb.HSFS=High Speed in Full Speed mode
#IRSB.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

############## Optimizations
IRSB.menu.opt.osstd=Smallest (-Os default)
IRSB.menu.opt.oslto=Smallest (-Os) with LTO
IRSB.menu.opt.oslto.build.flags.optimize=-Os -flto
IRSB.menu.opt.o1std=Fast (-O1)
IRSB.menu.opt.o1std.build.flags.optimize=-O1
IRSB.menu.opt.o1lto=Fast (-O1) with LTO
IRSB.menu.opt.o1lto.build.flags.optimize=-O1 -flto
IRSB.menu.opt.o2std=Faster (-O2)
IRSB.menu.opt.o2std.build.flags.optimize=-O2
IRSB.menu.opt.o2lto=Faster (-O2) with LTO
IRSB.menu.opt.o2lto.build.flags.optimize=-O2 -flto
IRSB.menu.opt.o3std=Fastest (-O3)
IRSB.menu.opt.o3std.build.flags.optimize=-O3
IRSB.menu.opt.o3lto=Fastest (-O3) with LTO
IRSB.menu.opt.o3lto.build.flags.optimize=-O3 -flto
IRSB.menu.opt.ogstd=Debug (-g)
IRSB.menu.opt.ogstd.build.flags.optimize=-g -Og

########## C Runtime Library
IRSB.menu.rtlib.nano=Newlib Nano (default)
IRSB.menu.rtlib.nanofp=Newlib Nano + Float Printf
IRSB.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
IRSB.menu.rtlib.nanofs=Newlib Nano + Float Scanf
IRSB.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
IRSB.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
IRSB.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
IRSB.menu.rtlib.full=Newlib Standard
IRSB.menu.rtlib.full.build.flags.ldspecs=

############# Upload menu
IRSB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IRSB.menu.upload_method.serialMethod.upload.protocol=1
IRSB.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
IRSB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IRSB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IRSB.menu.upload_method.swdMethod.upload.protocol=0
IRSB.menu.upload_method.swdMethod.upload.options=-g
IRSB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IRSB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IRSB.menu.upload_method.dfuMethod.upload.protocol=2
IRSB.menu.upload_method.dfuMethod.upload.options=-g
IRSB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

IRSB.menu.upload_method.MassStorage=Mass Storage
IRSB.menu.upload_method.MassStorage.upload.protocol=
IRSB.menu.upload_method.MassStorage.upload.tool=massStorageCopy

# menu.show_serial_prints
IRSB.menu.show_serial_prints.yes= Yes
IRSB.menu.show_serial_prints.no= No
IRSB.menu.show_serial_prints.yes.build.show_serial_prints_flags=-DSHOW_ME_SERIAL_PRINTS=1
IRSB.menu.show_serial_prints.no.build.show_serial_prints_flags=

#
# menu.sysclk
IRSB.menu.sysclk.hsi16m=16 MHz
IRSB.menu.sysclk.hsi4m=4 MHz
IRSB.menu.sysclk.msi2097k=2.097 MHz
IRSB.menu.sysclk.hsi16m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=16
IRSB.menu.sysclk.hsi4m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=4
IRSB.menu.sysclk.msi2097k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=2

################################################################################
# IRMouse

IRMouse.name=IRMouse (The Mouse Board)

IRMouse.build.vid=0x0483
IRMouse.build.core=arduino
IRMouse.build.board=IRMouse
IRMouse.build.extra_flags=-D{build.product_line} {build.xSerial} -DARDUINO_IR_MOUSE_V0 -DHAVE_HWSERIAL2 {build.show_serial_prints_flags} {build.sysclk_flags} {build.sampling_interval}

# IRMouse board

IRMouse.upload.maximum_size=196608
IRMouse.upload.maximum_data_size=20480
IRMouse.build.mcu=cortex-m0
IRMouse.build.board=IRMouse
IRMouse.build.series=STM32L0xx
IRMouse.build.product_line=STM32L082xx
IRMouse.build.variant=IRMouse
IRMouse.build.cmsis_lib_gcc=arm_cortexM0l_math

############# Serialx activation
#IRMouse.menu.xserial.generic=Enabled (generic 'Serial')
#IRMouse.menu.xserial.none=Enabled (no generic 'Serial')
#IRMouse.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
#IRMouse.menu.xserial.disabled=Disabled (No Serial support)
#IRMouse.menu.xserial.disabled.build.xSerial=


#################### USB connectivity
#IRMouse.menu.usb.none=None
#IRMouse.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
#IRMouse.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
#IRMouse.menu.usb.CDC=CDC (no generic 'Serial')
#IRMouse.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
#IRMouse.menu.usb.HID=HID (keyboard and mouse)
#IRMouse.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#IRMouse.menu.xusb.FS=Low/Full Speed
#IRMouse.menu.xusb.HS=High Speed
#IRMouse.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
#IRMouse.menu.xusb.HSFS=High Speed in Full Speed mode
#IRMouse.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

############## Optimizations
IRMouse.menu.opt.osstd=Smallest (-Os default)
IRMouse.menu.opt.oslto=Smallest (-Os) with LTO
IRMouse.menu.opt.oslto.build.flags.optimize=-Os -flto
IRMouse.menu.opt.o1std=Fast (-O1)
IRMouse.menu.opt.o1std.build.flags.optimize=-O1
IRMouse.menu.opt.o1lto=Fast (-O1) with LTO
IRMouse.menu.opt.o1lto.build.flags.optimize=-O1 -flto
IRMouse.menu.opt.o2std=Faster (-O2)
IRMouse.menu.opt.o2std.build.flags.optimize=-O2
IRMouse.menu.opt.o2lto=Faster (-O2) with LTO
IRMouse.menu.opt.o2lto.build.flags.optimize=-O2 -flto
IRMouse.menu.opt.o3std=Fastest (-O3)
IRMouse.menu.opt.o3std.build.flags.optimize=-O3
IRMouse.menu.opt.o3lto=Fastest (-O3) with LTO
IRMouse.menu.opt.o3lto.build.flags.optimize=-O3 -flto
IRMouse.menu.opt.ogstd=Debug (-g)
IRMouse.menu.opt.ogstd.build.flags.optimize=-g -Og

########## C Runtime Library
IRMouse.menu.rtlib.nano=Newlib Nano (default)
IRMouse.menu.rtlib.nanofp=Newlib Nano + Float Printf
IRMouse.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
IRMouse.menu.rtlib.nanofs=Newlib Nano + Float Scanf
IRMouse.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
IRMouse.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
IRMouse.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
IRMouse.menu.rtlib.full=Newlib Standard
IRMouse.menu.rtlib.full.build.flags.ldspecs=

############# Upload menu
IRMouse.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IRMouse.menu.upload_method.serialMethod.upload.protocol=1
IRMouse.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
IRMouse.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IRMouse.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IRMouse.menu.upload_method.swdMethod.upload.protocol=0
IRMouse.menu.upload_method.swdMethod.upload.options=-g
IRMouse.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IRMouse.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IRMouse.menu.upload_method.dfuMethod.upload.protocol=2
IRMouse.menu.upload_method.dfuMethod.upload.options=-g
IRMouse.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

IRMouse.menu.upload_method.MassStorage=Mass Storage
IRMouse.menu.upload_method.MassStorage.upload.protocol=
IRMouse.menu.upload_method.MassStorage.upload.tool=massStorageCopy

# menu.show_serial_prints
IRMouse.menu.show_serial_prints.yes= Yes
IRMouse.menu.show_serial_prints.no= No
IRMouse.menu.show_serial_prints.yes.build.show_serial_prints_flags=-DSHOW_ME_SERIAL_PRINTS=1
IRMouse.menu.show_serial_prints.no.build.show_serial_prints_flags=

# menu.sysclk
IRMouse.menu.sysclk.hsi16m=16 MHz
IRMouse.menu.sysclk.hsi4m=4 MHz
IRMouse.menu.sysclk.msi2097k=2.097 MHz
IRMouse.menu.sysclk.hsi16m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=16
IRMouse.menu.sysclk.hsi4m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=4
IRMouse.menu.sysclk.msi2097k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=2

# menu.smplIntrvl
IRMouse.menu.smplIntrvl.minutes_5=5 minutes
IRMouse.menu.smplIntrvl.minutes_1=1 minute
IRMouse.menu.smplIntrvl.minutes_3=3 minutes
IRMouse.menu.smplIntrvl.minutes_10=10 minutes
IRMouse.menu.smplIntrvl.minutes_15=15 minutes
IRMouse.menu.smplIntrvl.minutes_20=20 minutes

IRMouse.menu.smplIntrvl.minutes_5.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=5
IRMouse.menu.smplIntrvl.minutes_1.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=1
IRMouse.menu.smplIntrvl.minutes_3.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=3
IRMouse.menu.smplIntrvl.minutes_10.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=10
IRMouse.menu.smplIntrvl.minutes_15.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=15
IRMouse.menu.smplIntrvl.minutes_20.build.sampling_interval=-DDEFAULT_SAMPLING_TIME=20
